[
    {
        "title": "Thermorégulation passive",
        "icon": "wb_sunny",
        "description": "Le caméléon n'a pas besoin de transpirer ni de haleter comme certains animaux pour réguler sa température. Il se contente de se déplacer entre les zones ensoleillées et ombragées, absorbant la chaleur du soleil ou au contraire se réfugiant à l'ombre. Sa peau et ses changements de couleur jouent aussi un rôle : en devenant plus foncé, il capte davantage de chaleur, et en s'éclaircissant, il en reflète une partie. C'est un véritable maître de l'économie d'énergie, comme une « pile vivante » qui se recharge à la lumière.",
        "chameleonColor": "yellow",
        "background": "#E3CD0F"
    },
    {
        "title": "Perception UV",
        "icon": "eyeglasses_2",
        "description": "Les yeux du caméléon sont extraordinairement sensibles : ils peuvent voir non seulement dans le spectre visible comme nous, mais aussi dans l'ultraviolet. Cela lui donne accès à un monde de signaux invisibles pour l'homme. Par exemple, certains insectes réfléchissent la lumière UV, ce qui les rend plus faciles à repérer. Cette vision unique joue aussi un rôle dans la communication entre caméléons, car certains reflets sur leur peau ne sont perceptibles qu'en ultraviolet.",
        "chameleonColor": "purple",
        "background": "#912F8E"
    },
    {
        "title": "Stress et émotions visibles",
        "icon": "palette",
        "description": "Le corps du caméléon reflète directement son état émotionnel. Lorsqu'il est stressé, menacé ou en colère, sa peau peut s'assombrir jusqu'à devenir presque noire. À l'inverse, en période de calme ou lors des parades amoureuses, il peut arborer des couleurs éclatantes et vives. Sa peau agit comme un écran émotionnel, rendant visibles ses tensions ou ses intentions. Cela lui permet d'avertir un rival, d'attirer un partenaire ou de dissuader un prédateur.",
        "chameleonColor": "red",
        "background": "#912F2F"
    },
    {
        "title": "Le roi du ralenti",
        "icon": "hourglass",
        "description": "La démarche du caméléon est si lente et calculée qu'il semble parfois figé dans le temps. Il avance en balançant son corps d'avant en arrière pour imiter le mouvement des feuilles dans le vent, ce qui le rend presque invisible pour les prédateurs et ses proies. Ce rythme paisible est si marqué qu'il arrive que des insectes se posent ou grimpent sur lui sans qu'il réagisse immédiatement. Mais quand il s'agit de chasser, tout change : sa langue fulgurante peut alors jaillir en moins d'une seconde.",
        "chameleonColor": "blue",
        "background": "#2F8491"
    },
    {
        "title": "Queue préhensile",
        "icon": "eco",
        "description": "La queue du caméléon est bien plus qu'un simple appendice : elle agit comme une cinquième main. Totalement préhensile, elle peut s'enrouler fermement autour des branches, offrant une sécurité supplémentaire quand il grimpe dans les arbres. Grâce à cette queue, il peut rester suspendu tête en bas ou stabiliser son corps pendant qu'il vise une proie. C'est un atout vital pour un animal arboricole, qui passe la majorité de sa vie en hauteur.",
        "chameleonColor": "green",
        "background": "#76912F"
    }
]
